Revit 2024 API
BuiltInFailures.StairRampFailures.WinderLegTooShortOrRunWidthTooGreatFailure Property
 One leg of the winder run is too small or the runwidth is too great.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId WinderLegTooShortOrRunWidthTooGreatFailure { get; }
Visual Basic
Public Shared ReadOnly Property WinderLegTooShortOrRunWidthTooGreatFailure As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ WinderLegTooShortOrRunWidthTooGreatFailure {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace